benchmark/experiment-2/10ms-tmaret-002-fibers-unbounded-250.txt
Running 25s test @ http://localhost:8080/sync?cpuIterations=133&idleDelay=9&fileLength=1000
  250 threads and 250 connections
  Thread calibration: mean lat.: 1412.167ms, rate sampling interval: 5152ms
  Thread calibration: mean lat.: 1806.097ms, rate sampling interval: 6402ms
  Thread calibration: mean lat.: 1394.149ms, rate sampling interval: 5099ms
  Thread calibration: mean lat.: 1777.821ms, rate sampling interval: 6385ms
  Thread calibration: mean lat.: 1758.543ms, rate sampling interval: 6250ms
  Thread calibration: mean lat.: 1420.331ms, rate sampling interval: 5132ms
  Thread calibration: mean lat.: 1728.552ms, rate sampling interval: 6156ms
  Thread calibration: mean lat.: 1426.086ms, rate sampling interval: 5185ms
  Thread calibration: mean lat.: 1771.094ms, rate sampling interval: 6262ms
  Thread calibration: mean lat.: 1407.761ms, rate sampling interval: 5099ms
  Thread calibration: mean lat.: 1410.961ms, rate sampling interval: 5074ms
  Thread calibration: mean lat.: 1423.589ms, rate sampling interval: 5242ms
  Thread calibration: mean lat.: 1771.350ms, rate sampling interval: 6279ms
  Thread calibration: mean lat.: 1735.332ms, rate sampling interval: 6217ms
  Thread calibration: mean lat.: 1478.783ms, rate sampling interval: 5320ms
  Thread calibration: mean lat.: 1736.805ms, rate sampling interval: 6156ms
  Thread calibration: mean lat.: 1795.192ms, rate sampling interval: 6426ms
  Thread calibration: mean lat.: 1427.836ms, rate sampling interval: 5169ms
  Thread calibration: mean lat.: 1801.334ms, rate sampling interval: 6352ms
  Thread calibration: mean lat.: 1429.366ms, rate sampling interval: 5140ms
  Thread calibration: mean lat.: 1443.181ms, rate sampling interval: 5279ms
  Thread calibration: mean lat.: 1424.981ms, rate sampling interval: 5165ms
  Thread calibration: mean lat.: 1736.904ms, rate sampling interval: 6156ms
  Thread calibration: mean lat.: 1790.657ms, rate sampling interval: 6389ms
  Thread calibration: mean lat.: 1815.592ms, rate sampling interval: 6422ms
  Thread calibration: mean lat.: 1401.560ms, rate sampling interval: 5062ms
  Thread calibration: mean lat.: 1803.740ms, rate sampling interval: 6418ms
  Thread calibration: mean lat.: 1425.683ms, rate sampling interval: 5181ms
  Thread calibration: mean lat.: 1475.099ms, rate sampling interval: 5337ms
  Thread calibration: mean lat.: 1771.979ms, rate sampling interval: 6266ms
  Thread calibration: mean lat.: 1783.589ms, rate sampling interval: 6316ms
  Thread calibration: mean lat.: 1469.389ms, rate sampling interval: 5337ms
  Thread calibration: mean lat.: 1440.624ms, rate sampling interval: 5197ms
  Thread calibration: mean lat.: 1432.550ms, rate sampling interval: 5173ms
  Thread calibration: mean lat.: 1773.495ms, rate sampling interval: 6307ms
  Thread calibration: mean lat.: 1809.030ms, rate sampling interval: 6348ms
  Thread calibration: mean lat.: 1742.439ms, rate sampling interval: 6143ms
  Thread calibration: mean lat.: 1442.229ms, rate sampling interval: 5177ms
  Thread calibration: mean lat.: 1797.688ms, rate sampling interval: 6410ms
  Thread calibration: mean lat.: 1460.719ms, rate sampling interval: 5287ms
  Thread calibration: mean lat.: 1782.565ms, rate sampling interval: 6336ms
  Thread calibration: mean lat.: 1402.832ms, rate sampling interval: 5042ms
  Thread calibration: mean lat.: 1451.378ms, rate sampling interval: 5238ms
  Thread calibration: mean lat.: 1778.352ms, rate sampling interval: 6361ms
  Thread calibration: mean lat.: 1431.737ms, rate sampling interval: 5140ms
  Thread calibration: mean lat.: 1412.207ms, rate sampling interval: 5087ms
  Thread calibration: mean lat.: 1783.845ms, rate sampling interval: 6283ms
  Thread calibration: mean lat.: 1742.680ms, rate sampling interval: 6217ms
  Thread calibration: mean lat.: 1429.486ms, rate sampling interval: 5165ms
  Thread calibration: mean lat.: 1428.748ms, rate sampling interval: 5181ms
  Thread calibration: mean lat.: 1786.221ms, rate sampling interval: 6307ms
  Thread calibration: mean lat.: 1746.607ms, rate sampling interval: 6242ms
  Thread calibration: mean lat.: 1411.915ms, rate sampling interval: 5103ms
  Thread calibration: mean lat.: 1458.619ms, rate sampling interval: 5259ms
  Thread calibration: mean lat.: 1791.361ms, rate sampling interval: 6377ms
  Thread calibration: mean lat.: 1450.179ms, rate sampling interval: 5214ms
  Thread calibration: mean lat.: 1814.163ms, rate sampling interval: 6463ms
  Thread calibration: mean lat.: 1808.297ms, rate sampling interval: 6418ms
  Thread calibration: mean lat.: 1490.283ms, rate sampling interval: 5357ms
  Thread calibration: mean lat.: 1763.356ms, rate sampling interval: 6332ms
  Thread calibration: mean lat.: 1450.054ms, rate sampling interval: 5259ms
  Thread calibration: mean lat.: 1446.193ms, rate sampling interval: 5197ms
  Thread calibration: mean lat.: 1756.484ms, rate sampling interval: 6242ms
  Thread calibration: mean lat.: 1745.555ms, rate sampling interval: 6168ms
  Thread calibration: mean lat.: 1408.959ms, rate sampling interval: 5046ms
  Thread calibration: mean lat.: 1839.412ms, rate sampling interval: 6483ms
  Thread calibration: mean lat.: 1447.067ms, rate sampling interval: 5173ms
  Thread calibration: mean lat.: 1819.963ms, rate sampling interval: 6455ms
  Thread calibration: mean lat.: 1456.822ms, rate sampling interval: 5246ms
  Thread calibration: mean lat.: 1447.191ms, rate sampling interval: 5165ms
  Thread calibration: mean lat.: 1791.051ms, rate sampling interval: 6348ms
  Thread calibration: mean lat.: 1779.773ms, rate sampling interval: 6307ms
  Thread calibration: mean lat.: 1426.384ms, rate sampling interval: 5091ms
  Thread calibration: mean lat.: 1769.858ms, rate sampling interval: 6234ms
  Thread calibration: mean lat.: 1416.545ms, rate sampling interval: 5058ms
  Thread calibration: mean lat.: 1414.448ms, rate sampling interval: 5111ms
  Thread calibration: mean lat.: 1773.471ms, rate sampling interval: 6324ms
  Thread calibration: mean lat.: 1430.833ms, rate sampling interval: 5140ms
  Thread calibration: mean lat.: 1447.104ms, rate sampling interval: 5201ms
  Thread calibration: mean lat.: 1816.907ms, rate sampling interval: 6471ms
  Thread calibration: mean lat.: 1824.546ms, rate sampling interval: 6447ms
  Thread calibration: mean lat.: 1806.093ms, rate sampling interval: 6369ms
  Thread calibration: mean lat.: 1448.755ms, rate sampling interval: 5177ms
  Thread calibration: mean lat.: 1787.580ms, rate sampling interval: 6316ms
  Thread calibration: mean lat.: 1432.769ms, rate sampling interval: 5152ms
  Thread calibration: mean lat.: 1774.544ms, rate sampling interval: 6234ms
  Thread calibration: mean lat.: 1419.671ms, rate sampling interval: 5103ms
  Thread calibration: mean lat.: 1453.461ms, rate sampling interval: 5181ms
  Thread calibration: mean lat.: 1806.665ms, rate sampling interval: 6373ms
  Thread calibration: mean lat.: 1762.700ms, rate sampling interval: 6254ms
  Thread calibration: mean lat.: 1426.366ms, rate sampling interval: 5103ms
  Thread calibration: mean lat.: 1800.097ms, rate sampling interval: 6410ms
  Thread calibration: mean lat.: 1452.241ms, rate sampling interval: 5169ms
  Thread calibration: mean lat.: 1808.580ms, rate sampling interval: 6365ms
  Thread calibration: mean lat.: 1732.803ms, rate sampling interval: 6160ms
  Thread calibration: mean lat.: 1439.552ms, rate sampling interval: 5185ms
  Thread calibration: mean lat.: 1855.090ms, rate sampling interval: 6537ms
  Thread calibration: mean lat.: 1432.390ms, rate sampling interval: 5115ms
  Thread calibration: mean lat.: 1461.020ms, rate sampling interval: 5169ms
  Thread calibration: mean lat.: 1455.789ms, rate sampling interval: 5173ms
  Thread calibration: mean lat.: 1789.078ms, rate sampling interval: 6324ms
  Thread calibration: mean lat.: 1790.409ms, rate sampling interval: 6307ms
  Thread calibration: mean lat.: 1465.839ms, rate sampling interval: 5193ms
  Thread calibration: mean lat.: 1745.251ms, rate sampling interval: 6180ms
  Thread calibration: mean lat.: 1463.636ms, rate sampling interval: 5251ms
  Thread calibration: mean lat.: 1799.434ms, rate sampling interval: 6328ms
  Thread calibration: mean lat.: 1762.729ms, rate sampling interval: 6234ms
  Thread calibration: mean lat.: 1457.496ms, rate sampling interval: 5210ms
  Thread calibration: mean lat.: 1427.423ms, rate sampling interval: 5185ms
  Thread calibration: mean lat.: 1773.692ms, rate sampling interval: 6254ms
  Thread calibration: mean lat.: 1474.316ms, rate sampling interval: 5259ms
  Thread calibration: mean lat.: 1808.368ms, rate sampling interval: 6389ms
  Thread calibration: mean lat.: 1786.713ms, rate sampling interval: 6336ms
  Thread calibration: mean lat.: 1441.905ms, rate sampling interval: 5148ms
  Thread calibration: mean lat.: 1477.822ms, rate sampling interval: 5251ms
  Thread calibration: mean lat.: 1814.728ms, rate sampling interval: 6381ms
  Thread calibration: mean lat.: 1785.988ms, rate sampling interval: 6283ms
  Thread calibration: mean lat.: 1433.702ms, rate sampling interval: 5148ms
  Thread calibration: mean lat.: 1460.796ms, rate sampling interval: 5271ms
  Thread calibration: mean lat.: 1827.460ms, rate sampling interval: 6410ms
  Thread calibration: mean lat.: 1802.321ms, rate sampling interval: 6340ms
  Thread calibration: mean lat.: 1457.382ms, rate sampling interval: 5185ms
  Thread calibration: mean lat.: 1835.612ms, rate sampling interval: 6451ms
  Thread calibration: mean lat.: 1453.734ms, rate sampling interval: 5218ms
  Thread calibration: mean lat.: 1460.153ms, rate sampling interval: 5259ms
  Thread calibration: mean lat.: 1490.587ms, rate sampling interval: 5332ms
  Thread calibration: mean lat.: 1836.160ms, rate sampling interval: 6414ms
  Thread calibration: mean lat.: 1820.166ms, rate sampling interval: 6393ms
  Thread calibration: mean lat.: 1463.937ms, rate sampling interval: 5193ms
  Thread calibration: mean lat.: 1838.573ms, rate sampling interval: 6455ms
  Thread calibration: mean lat.: 1448.537ms, rate sampling interval: 5148ms
  Thread calibration: mean lat.: 1815.314ms, rate sampling interval: 6365ms
  Thread calibration: mean lat.: 1809.257ms, rate sampling interval: 6361ms
  Thread calibration: mean lat.: 1479.507ms, rate sampling interval: 5242ms
  Thread calibration: mean lat.: 1806.278ms, rate sampling interval: 6361ms
  Thread calibration: mean lat.: 1500.988ms, rate sampling interval: 5312ms
  Thread calibration: mean lat.: 1813.637ms, rate sampling interval: 6381ms
  Thread calibration: mean lat.: 1453.006ms, rate sampling interval: 5169ms
  Thread calibration: mean lat.: 1462.613ms, rate sampling interval: 5271ms
  Thread calibration: mean lat.: 1838.360ms, rate sampling interval: 6479ms
  Thread calibration: mean lat.: 1481.083ms, rate sampling interval: 5251ms
  Thread calibration: mean lat.: 1834.428ms, rate sampling interval: 6430ms
  Thread calibration: mean lat.: 1495.414ms, rate sampling interval: 5308ms
  Thread calibration: mean lat.: 1806.789ms, rate sampling interval: 6373ms
  Thread calibration: mean lat.: 1467.454ms, rate sampling interval: 5251ms
  Thread calibration: mean lat.: 1818.402ms, rate sampling interval: 6373ms
  Thread calibration: mean lat.: 1437.643ms, rate sampling interval: 5079ms
  Thread calibration: mean lat.: 1835.494ms, rate sampling interval: 6414ms
  Thread calibration: mean lat.: 1500.192ms, rate sampling interval: 5353ms
  Thread calibration: mean lat.: 1859.020ms, rate sampling interval: 6553ms
  Thread calibration: mean lat.: 1418.079ms, rate sampling interval: 5070ms
  Thread calibration: mean lat.: 1845.312ms, rate sampling interval: 6410ms
  Thread calibration: mean lat.: 1449.723ms, rate sampling interval: 5103ms
  Thread calibration: mean lat.: 1489.367ms, rate sampling interval: 5267ms
  Thread calibration: mean lat.: 1809.308ms, rate sampling interval: 6369ms
  Thread calibration: mean lat.: 1881.974ms, rate sampling interval: 6594ms
  Thread calibration: mean lat.: 1510.864ms, rate sampling interval: 5386ms
  Thread calibration: mean lat.: 1848.958ms, rate sampling interval: 6512ms
  Thread calibration: mean lat.: 1463.359ms, rate sampling interval: 5238ms
  Thread calibration: mean lat.: 1847.928ms, rate sampling interval: 6418ms
  Thread calibration: mean lat.: 1833.187ms, rate sampling interval: 6434ms
  Thread calibration: mean lat.: 1484.656ms, rate sampling interval: 5263ms
  Thread calibration: mean lat.: 1468.902ms, rate sampling interval: 5210ms
  Thread calibration: mean lat.: 1489.566ms, rate sampling interval: 5259ms
  Thread calibration: mean lat.: 1822.381ms, rate sampling interval: 6381ms
  Thread calibration: mean lat.: 1468.356ms, rate sampling interval: 5218ms
  Thread calibration: mean lat.: 1839.321ms, rate sampling interval: 6463ms
  Thread calibration: mean lat.: 1879.665ms, rate sampling interval: 6590ms
  Thread calibration: mean lat.: 1503.053ms, rate sampling interval: 5386ms
  Thread calibration: mean lat.: 1856.654ms, rate sampling interval: 6508ms
  Thread calibration: mean lat.: 1797.451ms, rate sampling interval: 6352ms
  Thread calibration: mean lat.: 1453.230ms, rate sampling interval: 5189ms
  Thread calibration: mean lat.: 1467.917ms, rate sampling interval: 5185ms
  Thread calibration: mean lat.: 1802.443ms, rate sampling interval: 6328ms
  Thread calibration: mean lat.: 1855.936ms, rate sampling interval: 6549ms
  Thread calibration: mean lat.: 1461.934ms, rate sampling interval: 5156ms
  Thread calibration: mean lat.: 1465.339ms, rate sampling interval: 5185ms
  Thread calibration: mean lat.: 1821.883ms, rate sampling interval: 6324ms
  Thread calibration: mean lat.: 1470.354ms, rate sampling interval: 5222ms
  Thread calibration: mean lat.: 1826.981ms, rate sampling interval: 6320ms
  Thread calibration: mean lat.: 1460.352ms, rate sampling interval: 5095ms
  Thread calibration: mean lat.: 1459.310ms, rate sampling interval: 5152ms
  Thread calibration: mean lat.: 1848.024ms, rate sampling interval: 6471ms
  Thread calibration: mean lat.: 1440.885ms, rate sampling interval: 5173ms
  Thread calibration: mean lat.: 1821.669ms, rate sampling interval: 6369ms
  Thread calibration: mean lat.: 1824.021ms, rate sampling interval: 6463ms
  Thread calibration: mean lat.: 1483.998ms, rate sampling interval: 5263ms
  Thread calibration: mean lat.: 1457.107ms, rate sampling interval: 5185ms
  Thread calibration: mean lat.: 1817.393ms, rate sampling interval: 6340ms
  Thread calibration: mean lat.: 1804.142ms, rate sampling interval: 6365ms
  Thread calibration: mean lat.: 1866.150ms, rate sampling interval: 6561ms
  Thread calibration: mean lat.: 1493.134ms, rate sampling interval: 5308ms
  Thread calibration: mean lat.: 1457.926ms, rate sampling interval: 5169ms
  Thread calibration: mean lat.: 1825.362ms, rate sampling interval: 6377ms
  Thread calibration: mean lat.: 1838.966ms, rate sampling interval: 6492ms
  Thread calibration: mean lat.: 1488.532ms, rate sampling interval: 5304ms
  Thread calibration: mean lat.: 1863.564ms, rate sampling interval: 6492ms
  Thread calibration: mean lat.: 1443.431ms, rate sampling interval: 5103ms
  Thread calibration: mean lat.: 1801.496ms, rate sampling interval: 6307ms
  Thread calibration: mean lat.: 1492.114ms, rate sampling interval: 5283ms
  Thread calibration: mean lat.: 1879.219ms, rate sampling interval: 6602ms
  Thread calibration: mean lat.: 1479.947ms, rate sampling interval: 5255ms
  Thread calibration: mean lat.: 1488.664ms, rate sampling interval: 5279ms
  Thread calibration: mean lat.: 1794.165ms, rate sampling interval: 6291ms
  Thread calibration: mean lat.: 1449.863ms, rate sampling interval: 5124ms
  Thread calibration: mean lat.: 1835.280ms, rate sampling interval: 6451ms
  Thread calibration: mean lat.: 1776.135ms, rate sampling interval: 6242ms
  Thread calibration: mean lat.: 1466.797ms, rate sampling interval: 5206ms
  Thread calibration: mean lat.: 1826.957ms, rate sampling interval: 6369ms
  Thread calibration: mean lat.: 1482.738ms, rate sampling interval: 5320ms
  Thread calibration: mean lat.: 2308.775ms, rate sampling interval: 6615ms
  Thread calibration: mean lat.: 2328.932ms, rate sampling interval: 6688ms
  Thread calibration: mean lat.: 2587.371ms, rate sampling interval: 7725ms
  Thread calibration: mean lat.: 2332.317ms, rate sampling interval: 6721ms
  Thread calibration: mean lat.: 2358.450ms, rate sampling interval: 6733ms
  Thread calibration: mean lat.: 2319.453ms, rate sampling interval: 6631ms
  Thread calibration: mean lat.: 2586.412ms, rate sampling interval: 7655ms
  Thread calibration: mean lat.: 2580.805ms, rate sampling interval: 7602ms
  Thread calibration: mean lat.: 2590.899ms, rate sampling interval: 7704ms
  Thread calibration: mean lat.: 1808.757ms, rate sampling interval: 6402ms
  Thread calibration: mean lat.: 2623.666ms, rate sampling interval: 7778ms
  Thread calibration: mean lat.: 1454.200ms, rate sampling interval: 5160ms
  Thread calibration: mean lat.: 1448.425ms, rate sampling interval: 5107ms
  Thread calibration: mean lat.: 1459.205ms, rate sampling interval: 5226ms
  Thread calibration: mean lat.: 1754.805ms, rate sampling interval: 6205ms
  Thread calibration: mean lat.: 1851.548ms, rate sampling interval: 6524ms
  Thread calibration: mean lat.: 1429.741ms, rate sampling interval: 5074ms
  Thread calibration: mean lat.: 1464.223ms, rate sampling interval: 5251ms
  Thread calibration: mean lat.: 1823.279ms, rate sampling interval: 6479ms
  Thread calibration: mean lat.: 1811.201ms, rate sampling interval: 6406ms
  Thread calibration: mean lat.: 1447.038ms, rate sampling interval: 5185ms
  Thread calibration: mean lat.: 1824.383ms, rate sampling interval: 6397ms
  Thread calibration: mean lat.: 1446.191ms, rate sampling interval: 5169ms
  Thread calibration: mean lat.: 1858.326ms, rate sampling interval: 6574ms
  Thread calibration: mean lat.: 1462.864ms, rate sampling interval: 5226ms
  Thread calibration: mean lat.: 1426.152ms, rate sampling interval: 5091ms
  Thread calibration: mean lat.: 1797.240ms, rate sampling interval: 6340ms
  Thread calibration: mean lat.: 1797.099ms, rate sampling interval: 6311ms
  Thread calibration: mean lat.: 1442.580ms, rate sampling interval: 5124ms
  Thread calibration: mean lat.: 1827.586ms, rate sampling interval: 6414ms
  Thread calibration: mean lat.: 1787.112ms, rate sampling interval: 6295ms
  Thread calibration: mean lat.: 1461.030ms, rate sampling interval: 5193ms
  Thread calibration: mean lat.: 1487.256ms, rate sampling interval: 5234ms
  Thread calibration: mean lat.: 1872.774ms, rate sampling interval: 6492ms
  Thread calibration: mean lat.: 1545.130ms, rate sampling interval: 5410ms
  Thread calibration: mean lat.: 1866.376ms, rate sampling interval: 6565ms
  Thread calibration: mean lat.: 1493.256ms, rate sampling interval: 5255ms
  Thread calibration: mean lat.: 1832.604ms, rate sampling interval: 6438ms
  Thread calibration: mean lat.: 1833.627ms, rate sampling interval: 6451ms
  Thread calibration: mean lat.: 1514.250ms, rate sampling interval: 5337ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.54s     1.40s    9.28s    63.97%
    Req/Sec    55.00      2.49    59.00     86.87%
  341253 requests in 24.84s, 405.18MB read
Requests/sec:  13735.43
Transfer/sec:     16.31MB